In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('most_frequent_names.csv')

In [3]:
df.head()

   Order        Name  Gender       Decade  Frequency
0      1       MARIA  Female  Before 1930       2085
1      2      CARMEN  Female  Before 1930       1463
2      3      JOSEFA  Female  Before 1930       1032
3      4  MONTSERRAT  Female  Before 1930        879
4      5        ROSA  Female  Before 1930        762

In [12]:
for year in set(df['Decade']):
#     print(df[df['Decade'] == year and df['Gender'] == 'Male'].head())
     print(df[df['Decade'] == year].head())
#     df[year].to_csv(f'df{year}.csv')

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [13]:
df_male = df[df['Gender'] == 'Male']

In [14]:
df_male.head()

     Order       Name Gender       Decade  Frequency
500      1       JOSE   Male  Before 1930        822
501      2    ANTONIO   Male  Before 1930        591
502      3       JUAN   Male  Before 1930        524
503      4  FRANCISCO   Male  Before 1930        520
504      5     MANUEL   Male  Before 1930        481

In [15]:
for year in set(df_male['Decade']):
     print(df_male[df_male['Decade'] == year].head())

     Order    Name Gender Decade  Frequency
800      1   DAVID   Male   1980       2928
801      2  DANIEL   Male   1980       2392
802      3   JORDI   Male   1980       2172
803      4    MARC   Male   1980       2054
804      5  JAVIER   Male   1980       1825
     Order       Name Gender Decade  Frequency
550      1       JOSE   Male   1930       3165
551      2    ANTONIO   Male   1930       2368
552      3     MANUEL   Male   1930       1911
553      4  FRANCISCO   Male   1930       1887
554      5       JUAN   Male   1930       1877
     Order    Name Gender Decade  Frequency
850      1    MARC   Male   1990       2584
851      2   DAVID   Male   1990       1808
852      3  DANIEL   Male   1990       1638
853      4  ALBERT   Male   1990       1349
854      5  VICTOR   Male   1990       1342
     Order     Name Gender Decade  Frequency
700      1  ANTONIO   Male   1960       2926
701      2    JORDI   Male   1960       2924
702      3    JORGE   Male   1960       2338
703      4   CARLOS   Male   1960       2279
704      5   MANUEL   Male   1960       2137
      Order     Name Gender Decade  Frequency
1050      1  ANTONIO   Male  TOTAL      16709
1051      2     JOSE   Male  TOTAL      15740
1052      3    JORDI   Male  TOTAL      13723
1053      4    DAVID   Male  TOTAL      12528
1054      5   MANUEL   Male  TOTAL      12453
     Order    Name Gender Decade  Frequency
750      1   DAVID   Male   1970       4393
751      2   JORDI   Male   1970       3485
752      3  DANIEL   Male   1970       2510
753      4  CARLOS   Male   1970       2307
754      5  JAVIER   Male   1970       2287
     Order  Name Gender Decade  Frequency
950      1  MARC   Male   2010       1422
951      2  ALEX   Male   2010       1037
952      3   POL   Male   2010       1003
953      4  ERIC   Male   2010        902
954      5   PAU   Male   2010        882
     Order       Name Gender Decade  Frequency
650      1    ANTONIO   Male   1950       3587
651      2       JOSE   Male   1950       3414
652      3  FRANCISCO   Male   1950       2762
653      4     MANUEL   Male   1950       2754
654      5       JUAN   Male   1950       2278
     Order       Name Gender Decade  Frequency
600      1       JOSE   Male   1940       4226
601      2    ANTONIO   Male   1940       3816
602      3  FRANCISCO   Male   1940       2868
603      4     MANUEL   Male   1940       2851
604      5       JUAN   Male   1940       2590
     Order       Name Gender       Decade  Frequency
500      1       JOSE   Male  Before 1930        822
501      2    ANTONIO   Male  Before 1930        591
502      3       JUAN   Male  Before 1930        524
503      4  FRANCISCO   Male  Before 1930        520
504      5     MANUEL   Male  Before 1930        481
     Order    Name Gender Decade  Frequency
900      1    MARC   Male   2000       2309
901      2    ALEX   Male   2000       1631
902      3     POL   Male   2000       1563
903      4     PAU   Male   2000       1499
904      5  DANIEL   Male   2000       1246

In [9]:
df['Decade'].head()

0    Before 1930
1    Before 1930
2    Before 1930
3    Before 1930
4    Before 1930
Name: Decade, dtype: object